Project/Toir/src/Documents/торо_СостоянияОбъектовРемонта/торо_СостоянияОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_СостоянияОбъектовРемонта</name>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <basedOn>Document.торо_АктОВыполненииЭтапаРабот</basedOn>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <registerRecords>InformationRegister.торо_ТекущееСостояниеОР</registerRecords>
  <registerRecords>AccumulationRegister.торо_КоличествоПусковОР</registerRecords>
  <registerRecords>AccumulationRegister.торо_ВремяПростояОборудования</registerRecords>
  <registerRecords>AccumulationRegister.торо_ВремяНахожденияВСостоянии</registerRecords>
  <registerRecords>AccumulationRegister.торо_ОстановленноеОборудование</registerRecords>
  <registerRecords>AccumulationRegister.торо_ОборудованиеНаИспытаниях</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.торо_ВидыОперацийОтклоненияВРаботеОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭксплуатации</name>
    <type>
      <types>CatalogRef.торо_ВидыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ПричинаСоздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыРемонта</name>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаПростоя</name>
      <type>
        <types>CatalogRef.торо_ПричиныПростояОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзменятьСостояниеПодчиненныхОР</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЭксплуатации</name>
      <type>
        <types>CatalogRef.торо_ВидыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПуска</name>
      <type>
        <types>CatalogRef.торо_ВидыПусковОР</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЭксплуатацииНаПериод</name>
      <type>
        <types>CatalogRef.торо_ВидыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПускаНаПериод</name>
      <type>
        <types>CatalogRef.торо_ВидыПусковОР</types>
      </type>
    </attributes>
    <attributes>
      <name>Иерархия</name>
      <comment>Предназначен для определения иерархии для структуры которой будет распространятся наработка.</comment>
      <type>
        <types>CatalogRef.торо_СтруктурыОР</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийОР</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Enums/торо_ВидыОперацийОтклоненияВРаботеОборудования/торо_ВидыОперацийОтклоненияВРаботеОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыОперацийОтклоненияВРаботеОборудования</name>
  <enumValues>
    <name>ВидЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ВидЭксплуатацииНаПериод</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/торо_ТипЭксплуатации/торо_ТипЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ТипЭксплуатации</name>
  <enumValues>
    <name>Эксплуатация</name>
  </enumValues>
  <enumValues>
    <name>Простой</name>
  </enumValues>
  <enumValues>
    <name>Испытания</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Documents/торо_СостоянияОбъектовРемонта/Forms/ФормаЗаполненияДанныхОбИзмененииСостояния/Module.bsl
&НаКлиенте
Перем ВидПускаПростой;

&НаКлиенте
Перем ВидТипЭксплуатацияНаПериод;

&НаКлиенте
Перем ТекТипЭксплуатацииНаПериод;

&НаКлиенте
Перем ТекТипЭксплуатации;

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуОбъектовПоМассивуСтруктур(Параметры.МассивСтруктурСтрокТЧ);
	УстановитьЗначенияПоУмолчанию();
	ЗаполнитьТекстДокумента(Параметры.Ссылка);
	ВидОперацииДокумента = Параметры.ВидОперации;
	ВопросПриЗакрытии = Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьИНаименованияКолонокОтВидаОперации();
	ИзменитьЗначенияФлажков(Истина);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидЭксплуатацииНаПериодПриИзменении(Элемент)
	
	ТекТипЭксплуатацииНаПериод = ПолучитьТипЭксплуатацииДляВидаЭксплуатации(ВидЭксплуатацииНаПериод);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЭксплуатацииПриИзменении(Элемент)
	
	ТекТипЭксплуатации = ПолучитьТипЭксплуатацииДляВидаЭксплуатации(ВидЭксплуатации);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыРемонта

&НаКлиенте
Процедура ОбъектыРемонтаВидЭксплуатацииНаПериодПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОбъектыРемонта.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ТипЭксплуатацииНаПериод = ПолучитьТипЭксплуатацииДляВидаЭксплуатации(ТекДанные.ВидЭксплуатацииНаПериод);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРемонтаВидЭксплуатацииПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОбъектыРемонта.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ТипЭксплуатации = ПолучитьТипЭксплуатацииДляВидаЭксплуатации(ТекДанные.ВидЭксплуатации);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	ИзменитьЗначенияФлажков(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	ИзменитьЗначенияФлажков(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьФлажки(Команда)
	ИзменитьЗначенияФлажков();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанные(Команда)
	
	Для Каждого Строка Из ОбъектыРемонта Цикл
		Если Строка.Пометка Тогда
			
			Если НЕ НеМенятьЗаполненныеЗначенияДат
				ИЛИ НЕ (ЗначениеЗаполнено(Строка.ДатаОкончания) И НеМенятьЗаполненныеЗначенияДат) Тогда
				
				Строка.ДатаОкончания = ДатаОкончания;
			КонецЕсли;

			Если НЕ НеМенятьЗаполненныеВидыЭксплуатации
				ИЛИ НЕ (ЗначениеЗаполнено(Строка.ВидЭксплуатации) И НеМенятьЗаполненныеВидыЭксплуатации) Тогда
				
				Строка.ВидЭксплуатации = ВидЭксплуатации;
				Строка.ТипЭксплуатации = ТекТипЭксплуатации;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Строка.ВидЭксплуатации) 
				И НЕ Строка.ТипЭксплуатации = ВидПускаПростой
				И (НЕ НеМенятьЗаполненныеВидыПуска ИЛИ НЕ (ЗначениеЗаполнено(Строка.ВидПуска) И НеМенятьЗаполненныеВидыПуска)) Тогда
				
				Строка.ВидПуска = ВидПуска;
			КонецЕсли;
			
			Если НЕ НеМенятьЗаполненныеПримечания
				ИЛИ Не (ЗначениеЗаполнено(Строка.Примечание) И НеМенятьЗаполненныеПримечания) Тогда
				Строка.Примечание = Примечание;
			КонецЕсли;
			Если ВидОперацииДокумента = ВидТипЭксплуатацияНаПериод Тогда
				
				Если НЕ НеМенятьЗаполненныеЗначенияДат
					ИЛИ НЕ (ЗначениеЗаполнено(Строка.ДатаНачала) И НеМенятьЗаполненныеЗначенияДат) Тогда
					
					Строка.ДатаНачала = ДатаНачала;
				КонецЕсли; 
				
				Если НЕ НеМенятьЗаполненныеВидыЭксплуатацииНаПериод
					ИЛИ НЕ (ЗначениеЗаполнено(Строка.ВидЭксплуатацииНаПериод) И НеМенятьЗаполненныеВидыЭксплуатацииНаПериод) Тогда
					
					Строка.ВидЭксплуатацииНаПериод = ВидЭксплуатацииНаПериод;
					Строка.ТипЭксплуатацииНаПериод = ТекТипЭксплуатацииНаПериод;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Строка.ВидЭксплуатацииНаПериод) 
					И НЕ Строка.ТипЭксплуатацииНаПериод = ВидПускаПростой
					И (НЕ НеМенятьЗаполненныеВидыПускаНаПериод ИЛИ НЕ (ЗначениеЗаполнено(Строка.ВидПускаНаПериод) И НеМенятьЗаполненныеВидыПускаНаПериод)) Тогда
					
					Строка.ВидПускаНаПериод = ВидПускаНаПериод;
				КонецЕсли;
				
				Если ((ЗначениеЗаполнено(Строка.ВидЭксплуатацииНаПериод)
							И Строка.ТипЭксплуатацииНаПериод = ВидПускаПростой)
						ИЛИ ЗначениеЗаполнено(Строка.ВидЭксплуатации) 
							И Строка.ТипЭксплуатации = ВидПускаПростой)
					И (НЕ НеМенятьЗаполненныеПричиныПростоя ИЛИ НЕ (ЗначениеЗаполнено(Строка.ПричинаПростоя) И НеМенятьЗаполненныеПричиныПростоя)) Тогда
					
						Строка.ПричинаПростоя = ПричинаПростоя;
				КонецЕсли;
			Иначе
				Если ЗначениеЗаполнено(Строка.ВидЭксплуатации) И Строка.ТипЭксплуатации = ВидПускаПростой
					И (НЕ НеМенятьЗаполненныеПричиныПростоя ИЛИ НЕ (ЗначениеЗаполнено(Строка.ПричинаПростоя) И НеМенятьЗаполненныеПричиныПростоя)) Тогда
					
					Строка.ПричинаПростоя = ПричинаПростоя;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	МассивСтруктур = Новый Массив;
	КолонкиТЧ = "НомерСтроки, ДатаОкончания, ДатаНачала, ОбъектРемонта, ПричинаПростоя, ВидЭксплуатации, ВидПуска, ВидЭксплуатацииНаПериод, ВидПускаНаПериод, Примечание, ТипЭксплуатации, ТипЭксплуатацииНаПериод";
	
	Для каждого СтрокаТЧ Из ОбъектыРемонта Цикл
	
		СтруктураСтрокиТЧ = Новый Структура(КолонкиТЧ);
		ЗаполнитьЗначенияСвойств(СтруктураСтрокиТЧ, СтрокаТЧ);
		МассивСтруктур.Добавить(СтруктураСтрокиТЧ);
		
	КонецЦикла;
	Закрыть(МассивСтруктур);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИзменениеРеквизитовФормы
&НаСервере
Процедура ЗаполнитьТекстДокумента(Ссылка)

	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Документ = НСтр("es='Los estados de los objetos de la reparación (Nuevo)';ru='Состояния объектов ремонта (Новый)';en='Status of repair objects (New)'");
	Иначе
		Документ = Строка(Ссылка);
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()

	ЗначенияФлаговНеизменности = Истина;
	
	НеМенятьЗаполненныеВидыПуска				= ЗначенияФлаговНеизменности;
	НеМенятьЗаполненныеВидыПускаНаПериод		= ЗначенияФлаговНеизменности;
	НеМенятьЗаполненныеВидыЭксплуатации			= ЗначенияФлаговНеизменности;
	НеМенятьЗаполненныеВидыЭксплуатацииНаПериод	= ЗначенияФлаговНеизменности;
	НеМенятьЗаполненныеЗначенияДат				= ЗначенияФлаговНеизменности;
	НеМенятьЗаполненныеПримечания				= ЗначенияФлаговНеизменности;
	НеМенятьЗаполненныеПричиныПростоя			= ЗначенияФлаговНеизменности;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗначенияФлажков(НовоеЗначение = Неопределено)

	Для каждого СтрокаТЧ Из ОбъектыРемонта Цикл
		СтрокаТЧ.Пометка = ?(НовоеЗначение = Неопределено, Не СтрокаТЧ.Пометка, НовоеЗначение);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОбъектовПоМассивуСтруктур(МассивСтруктурСтрок)
	
	Для Каждого СтруктураСтроки Из МассивСтруктурСтрок Цикл
		НС = ОбъектыРемонта.Добавить();
		ЗаполнитьЗначенияСвойств(НС, СтруктураСтроки);
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

&НаСервереБезКонтекста
Функция ПолучитьТипЭксплуатацииДляВидаЭксплуатации(ВидЭксплуатацииСсылка)

	Возврат ВидЭксплуатацииСсылка.ТипЭксплуатации;

КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьИНаименованияКолонокОтВидаОперации()

	ВидНаПериод = ВидОперацииДокумента = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатацииНаПериод");
	ЗаголовокДатыОкончания = ?(ВидНаПериод,НСтр("es='La terminación del período';ru='Окончание периода';en='End of period'"),НСтр("es='La fecha del cambio del estado';ru='Дата изменения состояния';en='Status change date'"));
	
	Элементы.ДатаНачала.Видимость												= ВидНаПериод;
	Элементы.ДатаОкончания.Заголовок											= ЗаголовокДатыОкончания;
	Элементы.ВидЭксплуатацииНаПериод.Видимость									= ВидНаПериод;
	Элементы.НеМенятьЗаполненныеВидыЭксплуатацииНаПериод.Видимость				= ВидНаПериод;
	Элементы.ВидПускаНаПериод.Видимость											= ВидНаПериод;
	Элементы.НеМенятьЗаполненныеВидыПускаНаПериод.Видимость						= ВидНаПериод;
	
	Элементы.ОбъектыРемонтаДатаНачала.Видимость									= ВидНаПериод;
	Элементы.ОбъектыРемонтаДатаНачала.АвтоОтметкаНезаполненного					= ВидНаПериод;
	Элементы.ОбъектыРемонтаВидЭксплуатацииНаПериод.Видимость					= ВидНаПериод;
	Элементы.ОбъектыРемонтаВидЭксплуатацииНаПериод.АвтоОтметкаНезаполненного	= ВидНаПериод;
	Элементы.ОбъектыРемонтаДатаОкончания.Заголовок								= ЗаголовокДатыОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЭтаФорма.Модифицированность И ВопросПриЗакрытии = Ложь Тогда
		ВопросПриЗакрытии = Истина;
	КонецЕсли; 
	Если ВопросПриЗакрытии Тогда
		Отказ = Истина;
		Если Не ЗавершениеРаботы Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, НСтр("es='Los datos eran cambiados. ¿Conservar los cambios?';ru='Данные были изменены. Сохранить изменения?';en='Data has been changed. Save changes?'"), РежимДиалогаВопрос.ДаНетОтмена);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ВопросПриЗакрытии = Ложь;
		ЭтаФорма.Модифицированность = Ложь;
		ПеренестиВДокумент("");
	КонецЕсли;

	Если Результат = КодВозвратаДиалога.Нет Тогда 
		ВопросПриЗакрытии = Ложь;
		ЭтаФорма.Модифицированность = Ложь;
		ЭтаФорма.Закрыть();
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#Область ОператорыОсновнойПрограммы

#Если НаКлиенте Тогда 
ВидПускаПростой = ПредопределенноеЗначение("Перечисление.торо_ТипЭксплуатации.Простой");
ВидТипЭксплуатацияНаПериод = ПредопределенноеЗначение("Перечисление.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатацииНаПериод");
#КонецЕсли

#КонецОбласти
